Tekla.Structures.Model.Operations.Operation.SolidFaceToPointList(Tekla.Structures.Solid.Face)
Returns list of vertex points inside a solid face.
solidFace: Solid face to get points from.
Returns: Returns list of vertex points inside a solid face.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByParts(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.ConnectiveGeometry).
part1: One part used for creating the bent plate.
part2: The other part used for creating the bent plate.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown if received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point})
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment).
part1: The first part.
face1: The selected face on the first part.
part2: The second part.
face2: The selected face on the second part.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment).
part1: The first part.
face1: The selected solid face on the first part.
part2: The second part.
face2: The selected solid face on the second part.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.